num_layers: 122
quant_type: SYMMETRIC
calib_type: PERTENSOR
layers {
  layer_name: "input"
  layer_type: "TIDL_DataLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 255
    size: 1
    element_type: 6
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "input_netFormat"
  layer_type: "TIDL_DataConvertLayer"
  bit_depth: 4
  outputs {
    min: 0
    max: 254.999985
    size: 1
    element_type: 3
    scale: 128
    zero_point: 0
  }
}
layers {
  layer_name: "1"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: -43.7248955
    max: 36.6022606
    size: 1
    element_type: 3
    scale: 668.29205322265625
    zero_point: 0
  }
  weights {
    min: -0.0892769694
    max: 0.0957665145
    size: 1
    element_type: 3
    scale: 342165.53125
    zero_point: 0
  }
  bias {
    min: -2.63428783
    max: 3.45522332
    size: 12
    element_type: 0
    scale: 9483.6123046875
    zero_point: 0
    value: -0.036497525870800018
    value: -0.73818087577819824
    value: -1.7089519500732422
    value: 0.83317619562149048
    value: -2.6342878341674805
    value: 1.3423796892166138
    value: 1.4280698299407959
    value: 2.6684863567352295
    value: -0.30237969756126404
    value: 3.4552233219146729
    value: 0.0444570891559124
    value: 0.94042962789535522
  }
}
layers {
  layer_name: "3"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 34.0781822
    size: 1
    element_type: 2
    scale: 1178.9068603515625
    zero_point: 0
  }
  weights {
    min: -0.566874385
    max: 0.563368559
    size: 1
    element_type: 3
    scale: 57804.6953125
    zero_point: 0
  }
  bias {
    min: -1.25547099
    max: 2.98538947
    size: 32
    element_type: 0
    scale: 10976.1220703125
    zero_point: 0
    value: 0.85229450464248657
    value: -0.19675172865390778
    value: 0.20494943857192993
    value: 0.932040274143219
    value: -0.11591377854347229
    value: 0.67455726861953735
    value: -0.2218843549489975
    value: -0.14454089105129242
    value: -0.12770931422710419
    value: 0.63680028915405273
    value: -0.11372686922550201
    value: -0.22832506895065308
    value: 0.86575776338577271
    value: 0.69151180982589722
    value: 0.43125906586647034
    value: -0.078818947076797485
    value: -0.10554668307304382
    value: -1.2554709911346436
    value: -0.20290014147758484
    value: 0.589642345905304
    value: 2.9853894710540771
    value: 0.41363802552223206
    value: -0.22262436151504517
    value: 2.1135735511779785
    value: 1.5598243474960327
    value: 0.53629171848297119
    value: -0.019496956840157509
    value: -0.26104769110679626
    value: -0.03298751637339592
    value: 1.1263878345489502
    value: -0.0781397670507431
    value: -0.22775031626224518
  }
}
layers {
  layer_name: "5"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 17.2392769
    size: 1
    element_type: 2
    scale: 2487.14599609375
    zero_point: 0
  }
  weights {
    min: -0.473999888
    max: 0.290720463
    size: 1
    element_type: 3
    scale: 69130.8203125
    zero_point: 0
  }
  bias {
    min: -3.22852802
    max: 3.77380776
    size: 64
    element_type: 0
    scale: 8683.0068359375
    zero_point: 0
    value: -0.45738226175308228
    value: 0.61574798822402954
    value: 2.7154049873352051
    value: 1.7260228395462036
    value: 3.7738077640533447
    value: 0.39071127772331238
    value: 0.44035518169403076
    value: 1.0478347539901733
    value: 0.54331684112548828
    value: 1.4703497886657715
    value: 0.94666159152984619
    value: 1.2423163652420044
    value: 0.28457775712013245
    value: 1.565640926361084
    value: -0.057327445596456528
    value: -0.27002453804016113
    value: 1.044605016708374
    value: 1.134979248046875
    value: 0.37979024648666382
    value: 0.79683065414428711
    value: 1.2650269269943237
    value: 0.838126003742218
    value: -0.44319713115692139
    value: -0.4539816677570343
    value: -0.13918080925941467
    value: -0.060403093695640564
    value: -1.1811405420303345
    value: -0.0919216051697731
    value: -3.2285280227661133
    value: 0.13322478532791138
    value: 0.34665638208389282
    value: -0.038921616971492767
    value: -0.11693666875362396
    value: 0.80267244577407837
    value: 2.730172872543335
    value: -0.032660990953445435
    value: 0.37282925844192505
    value: 1.2394742965698242
    value: 0.47311979532241821
    value: 0.67204415798187256
    value: 0.42753827571868896
    value: 3.0316967964172363
    value: 1.0612616539001465
    value: 1.2133234739303589
    value: 0.23575662076473236
    value: 0.60757523775100708
    value: 0.2750992476940155
    value: -0.19410493969917297
    value: -0.3621181845664978
    value: 0.57215076684951782
    value: 1.0359710454940796
    value: 1.1313793659210205
    value: -0.03064444288611412
    value: 0.062995493412017822
    value: 0.12508593499660492
    value: 0.35311618447303772
    value: -0.28949424624443054
    value: -0.35810711979866028
    value: 0.59999865293502808
    value: -0.093941293656826019
    value: 1.2998439073562622
    value: 0.24287642538547516
    value: 1.2030376195907593
    value: 0.7704121470451355
  }
}
layers {
  layer_name: "7"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 10.7006836
    size: 1
    element_type: 2
    scale: 4741.88427734375
    zero_point: 0
  }
  weights {
    min: -1.04901171
    max: 0.753557682
    size: 1
    element_type: 3
    scale: 31237.01953125
    zero_point: 0
  }
  bias {
    min: -1.33994853
    max: 2.33543944
    size: 32
    element_type: 0
    scale: 14030.763671875
    zero_point: 0
    value: 0.697163999080658
    value: 0.71906787157058716
    value: 0.50590187311172485
    value: -0.2114228755235672
    value: 0.86466062068939209
    value: 0.72283923625946045
    value: 0.26688814163208008
    value: 0.07107795774936676
    value: 1.1545846462249756
    value: 0.828315794467926
    value: 0.12336011230945587
    value: 0.32344961166381836
    value: 1.7958189249038696
    value: -1.3399485349655151
    value: 2.1747000217437744
    value: -0.91739344596862793
    value: 0.984938383102417
    value: 1.1333534717559814
    value: -0.50308185815811157
    value: 1.704755425453186
    value: 0.77054643630981445
    value: 0.12853367626667023
    value: 1.137323260307312
    value: 1.2043877840042114
    value: 0.69127058982849121
    value: 2.0355696678161621
    value: 1.3435920476913452
    value: 2.3354394435882568
    value: 0.98291009664535522
    value: 2.2523248195648193
    value: 1.3323385715484619
    value: 0.21783797442913055
  }
}
layers {
  layer_name: "9"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 6.79593468
    size: 1
    element_type: 2
    scale: 6785.46826171875
    zero_point: 0
  }
  weights {
    min: -0.733080149
    max: 0.447209954
    size: 1
    element_type: 3
    scale: 44699.0703125
    zero_point: 0
  }
  bias {
    min: -0.372128069
    max: 3.08882332
    size: 32
    element_type: 0
    scale: 10608.5703125
    zero_point: 0
    value: 0.19495688378810883
    value: 0.81776809692382812
    value: 1.0474588871002197
    value: 0.79091829061508179
    value: 0.98474901914596558
    value: 0.054445188492536545
    value: 1.6212016344070435
    value: 2.0891029834747314
    value: 0.78242117166519165
    value: 2.4202916622161865
    value: 1.7268509864807129
    value: 0.00912252627313137
    value: 0.46725434064865112
    value: 0.772553026676178
    value: 0.049366474151611328
    value: 0.53348422050476074
    value: 0.9120061993598938
    value: 0.56845498085021973
    value: 0.67339271306991577
    value: 0.32506248354911804
    value: 0.99481207132339478
    value: 1.5335824489593506
    value: -0.37212806940078735
    value: 1.1302441358566284
    value: 1.0026146173477173
    value: 1.536963939666748
    value: 0.46322265267372131
    value: 2.3721604347229004
    value: 0.27445292472839355
    value: 1.1575809717178345
    value: 3.0888233184814453
    value: 1.0948419570922852
  }
}
layers {
  layer_name: "11"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 9.20500183
    size: 1
    element_type: 2
    scale: 3895.92529296875
    zero_point: 0
  }
  weights {
    min: -1.40858388
    max: 1.74168336
    size: 1
    element_type: 3
    scale: 18813.982421875
    zero_point: 0
  }
  bias {
    min: -3.82437277
    max: 4.73399496
    size: 32
    element_type: 0
    scale: 6921.84912109375
    zero_point: 0
    value: 4.7339949607849121
    value: 2.9481277465820312
    value: 1.5627082586288452
    value: -1.1681234836578369
    value: 1.8694818019866943
    value: 0.030599607154726982
    value: 0.33915776014328003
    value: 2.6795194149017334
    value: -3.8243727684020996
    value: 3.149522066116333
    value: -1.3507198095321655
    value: 2.9232606887817383
    value: -1.8191821575164795
    value: 1.4940414428710938
    value: 2.3247966766357422
    value: -2.4109547138214111
    value: 0.94178032875061035
    value: -2.2276358604431152
    value: -1.5715712308883667
    value: 1.335148811340332
    value: 1.223347544670105
    value: 1.8998479843139648
    value: 4.047243595123291
    value: -0.2595561146736145
    value: 2.7357344627380371
    value: 0.51540583372116089
    value: -0.35298687219619751
    value: 1.8508398532867432
    value: -1.4319332838058472
    value: 3.2050890922546387
    value: -1.4392702579498291
    value: 1.1211671829223633
  }
}
layers {
  layer_name: "13"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 10.142272
    size: 1
    element_type: 2
    scale: 3254.49755859375
    zero_point: 0
  }
  weights {
    min: -1.19708967
    max: 0.740555704
    size: 1
    element_type: 3
    scale: 27373.0546875
    zero_point: 0
  }
  bias {
    min: -1.23761868
    max: 5.81407499
    size: 32
    element_type: 0
    scale: 5635.97802734375
    zero_point: 0
    value: 1.0580753087997437
    value: -0.95409953594207764
    value: 1.5403549671173096
    value: 0.91195118427276611
    value: -0.92130142450332642
    value: 2.0852141380310059
    value: 1.354417085647583
    value: 2.7296407222747803
    value: 5.311892032623291
    value: -0.12240388244390488
    value: 0.78137350082397461
    value: -0.0014122038846835494
    value: -0.91863113641738892
    value: 0.18825463950634003
    value: 2.09006404876709
    value: 0.70043420791625977
    value: 0.46424704790115356
    value: -1.2376186847686768
    value: -0.41758242249488831
    value: 1.6603394746780396
    value: 0.26463553309440613
    value: 5.8140749931335449
    value: 0.30524706840515137
    value: 3.4914405345916748
    value: 0.590282142162323
    value: -0.51408928632736206
    value: 3.8478400707244873
    value: -0.37611421942710876
    value: -0.46881812810897827
    value: 0.75135159492492676
    value: 3.170076847076416
    value: -0.14173036813735962
  }
}
layers {
  layer_name: "14"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 13.2187519
    size: 1
    element_type: 2
    scale: 3254.49755859375
    zero_point: 0
  }
}
layers {
  layer_name: "15"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 13.2354069
    size: 1
    element_type: 2
    scale: 3254.49755859375
    zero_point: 0
  }
}
layers {
  layer_name: "17"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 10.018631
    size: 1
    element_type: 2
    scale: 4844.07470703125
    zero_point: 0
  }
  weights {
    min: -0.974668086
    max: 1.34370244
    size: 1
    element_type: 3
    scale: 24386.3515625
    zero_point: 0
  }
  bias {
    min: -2.06502366
    max: 6.74595213
    size: 64
    element_type: 0
    scale: 4857.431640625
    zero_point: 0
    value: 2.3085250854492188
    value: 2.1877655982971191
    value: 0.0968439131975174
    value: 1.2813688516616821
    value: 0.84086579084396362
    value: 2.9244222640991211
    value: 0.9107518196105957
    value: 0.048109967261552811
    value: -0.67126643657684326
    value: -2.06502366065979
    value: 0.78008323907852173
    value: -0.036552011966705322
    value: -1.7073473930358887
    value: -1.9016096591949463
    value: 0.69594967365264893
    value: 1.2081427574157715
    value: -0.9539225697517395
    value: 1.5095846652984619
    value: -0.07935381680727005
    value: 0.76857095956802368
    value: -0.27513283491134644
    value: -1.9788578748703003
    value: -0.10779576748609543
    value: 0.753901481628418
    value: 0.45100006461143494
    value: 4.1765813827514648
    value: 1.8493854999542236
    value: 1.1713687181472778
    value: 1.1822197437286377
    value: -1.8344476222991943
    value: 0.91468179225921631
    value: 3.1719603538513184
    value: 1.4634343385696411
    value: -0.34933754801750183
    value: -1.6338181495666504
    value: 0.95499742031097412
    value: 0.66464215517044067
    value: 1.8027833700180054
    value: 0.59411525726318359
    value: 1.4519170522689819
    value: 1.9725080728530884
    value: 2.0471019744873047
    value: 4.32779598236084
    value: 1.4112675189971924
    value: 0.791851818561554
    value: -1.0643367767333984
    value: 2.8642086982727051
    value: 6.7459521293640137
    value: -0.54462480545043945
    value: 2.4333503246307373
    value: 0.3723333477973938
    value: 2.148935079574585
    value: 1.3959739208221436
    value: -0.47134214639663696
    value: 1.7209469079971313
    value: 0.097129225730896
    value: 1.3641930818557739
    value: -0.46358272433280945
    value: 2.5291280746459961
    value: -0.48093611001968384
    value: -0.4555782675743103
    value: 0.74087375402450562
    value: 0.14236004650592804
    value: 2.1550335884094238
  }
}
layers {
  layer_name: "19"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.94606209
    size: 1
    element_type: 2
    scale: 4516.9150390625
    zero_point: 0
  }
  weights {
    min: -0.344203413
    max: 0.536214948
    size: 1
    element_type: 3
    scale: 61109.8203125
    zero_point: 0
  }
  bias {
    min: -1.40514052
    max: 2.24931931
    size: 128
    element_type: 0
    scale: 14567.962890625
    zero_point: 0
    value: 0.74757510423660278
    value: -0.014137189835309982
    value: -0.36122021079063416
    value: 0.48952275514602661
    value: 0.68086689710617065
    value: 0.64131861925125122
    value: 1.8965756893157959
    value: 0.59394705295562744
    value: -0.91332441568374634
    value: -0.0039327102713286877
    value: 0.32596415281295776
    value: 0.31161272525787354
    value: 0.85604852437973022
    value: -1.3413188457489014
    value: 0.19998954236507416
    value: -0.20435404777526855
    value: 0.32796961069107056
    value: 0.64918047189712524
    value: 0.82098877429962158
    value: -0.787977397441864
    value: 0.43925085663795471
    value: 0.622898519039154
    value: 0.017911452800035477
    value: 0.453087717294693
    value: 1.1745489835739136
    value: 1.1846740245819092
    value: 0.82477933168411255
    value: 1.3111076354980469
    value: 0.40164309740066528
    value: 0.65763670206069946
    value: 0.51416045427322388
    value: -0.82474195957183838
    value: -0.50069665908813477
    value: 0.95173251628875732
    value: 0.40570113062858582
    value: 0.050789739936590195
    value: 0.83370137214660645
    value: 0.62321960926055908
    value: 0.49230051040649414
    value: -0.818898618221283
    value: 0.18767440319061279
    value: 0.4138704240322113
    value: 1.8212423324584961
    value: 1.1332241296768188
    value: -0.13962343335151672
    value: 0.5072169303894043
    value: -0.2940375804901123
    value: 0.34778404235839844
    value: -0.33370962738990784
    value: 0.46121159195899963
    value: -1.4051405191421509
    value: 2.249319314956665
    value: -0.10472764819860458
    value: 0.6594233512878418
    value: 0.93218469619750977
    value: 1.0945534706115723
    value: 0.0057341177016496658
    value: -0.33478105068206787
    value: 0.39186555147171021
    value: 0.282840371131897
    value: 0.89025211334228516
    value: 1.2763068675994873
    value: 0.17484387755393982
    value: 1.3582901954650879
    value: 0.7726171612739563
    value: 0.36561751365661621
    value: 0.10851122438907623
    value: 0.49852517247200012
    value: 0.19393597543239594
    value: 0.32421091198921204
    value: -0.88340425491333008
    value: -0.25213217735290527
    value: -0.73622024059295654
    value: 1.3991358280181885
    value: -0.13434423506259918
    value: 0.4316195547580719
    value: -0.26946127414703369
    value: 1.2612708806991577
    value: -0.027359908446669579
    value: 0.031697947531938553
    value: -0.81265246868133545
    value: 0.077666908502578735
    value: -0.75323468446731567
    value: -0.64146131277084351
    value: 0.34111765027046204
    value: 1.4195499420166016
    value: -0.4152824878692627
    value: -0.29213228821754456
    value: 1.9822167158126831
    value: -1.3405317068099976
    value: -1.0915840864181519
    value: 1.1995033025741577
    value: -1.1035304069519043
    value: 0.49533542990684509
    value: 0.20618870854377747
    value: -0.59614062309265137
    value: -0.476010262966156
    value: -1.0733736753463745
    value: 1.190232515335083
    value: 0.529715895652771
    value: -0.10870717465877533
    value: 1.1797994375228882
    value: 0.57188600301742554
    value: 0.10183518379926682
    value: -0.10396230965852737
    value: -0.011912206187844276
    value: 0.35237184166908264
    value: 0.63046425580978394
    value: -0.38830298185348511
    value: 1.0888973474502563
    value: -0.14314623177051544
    value: 0.46123808622360229
    value: 1.1146167516708374
    value: 0.911486029624939
    value: 0.84695887565612793
    value: 1.4420305490493774
    value: 1.1479977369308472
    value: 0.551228404045105
    value: 0.93748939037323
    value: 1.5953192710876465
    value: -0.32608473300933838
    value: 0.97621053457260132
    value: -0.379086971282959
    value: -1.1405879259109497
    value: -0.25103259086608887
    value: -0.37092941999435425
    value: 0.49743494391441345
    value: 1.4447129964828491
  }
}
layers {
  layer_name: "21"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 11.8970432
    size: 1
    element_type: 2
    scale: 3506.518310546875
    zero_point: 0
  }
  weights {
    min: -1.28814816
    max: 1.27920496
    size: 1
    element_type: 3
    scale: 25438.068359375
    zero_point: 0
  }
  bias {
    min: -4.42802429
    max: 2.9883225
    size: 64
    element_type: 0
    scale: 7400.14013671875
    zero_point: 0
    value: -3.9627978801727295
    value: -0.15211422741413116
    value: 1.5574631690979004
    value: 1.253657341003418
    value: -0.55311208963394165
    value: 0.9702184796333313
    value: 1.3604094982147217
    value: -1.9348065853118896
    value: -0.11917983740568161
    value: 0.643608570098877
    value: 0.7558133602142334
    value: 1.0231609344482422
    value: 0.088011331856250763
    value: -0.43050995469093323
    value: 1.3229655027389526
    value: -1.4691284894943237
    value: 2.8023519515991211
    value: 0.3295290470123291
    value: -0.056538958102464676
    value: 0.47351199388504028
    value: -1.7794800996780396
    value: -0.049482002854347229
    value: -0.085445649921894073
    value: 0.11950794607400894
    value: -0.77737671136856079
    value: 0.98247742652893066
    value: -1.2634257078170776
    value: 0.21213732659816742
    value: 0.42458546161651611
    value: 0.60504227876663208
    value: -2.50958251953125
    value: 0.80578196048736572
    value: -0.5588492751121521
    value: 1.3063905239105225
    value: 0.27704060077667236
    value: 0.628251314163208
    value: 1.518335223197937
    value: -0.9608917236328125
    value: 1.1489062309265137
    value: -0.970223605632782
    value: -1.6465185880661011
    value: 0.095877416431903839
    value: 1.4315575361251831
    value: -0.1263948529958725
    value: 2.9883224964141846
    value: 0.3362884521484375
    value: 0.17253105342388153
    value: 1.8044164180755615
    value: -0.48543363809585571
    value: 1.3453630208969116
    value: 0.84622633457183838
    value: -4.4280242919921875
    value: -0.031019983813166618
    value: -0.21317067742347717
    value: -0.2191971093416214
    value: -0.011146151460707188
    value: 0.41977742314338684
    value: 1.8135887384414673
    value: 1.9319217205047607
    value: -0.40373134613037109
    value: -0.698337197303772
    value: -2.0413591861724854
    value: -0.22471778094768524
    value: 0.1935572624206543
  }
}
layers {
  layer_name: "23"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 4.44398212
    size: 1
    element_type: 2
    scale: 5364.15283203125
    zero_point: 0
  }
  weights {
    min: -0.289225489
    max: 0.421027839
    size: 1
    element_type: 3
    scale: 77828.5859375
    zero_point: 0
  }
  bias {
    min: -0.522110283
    max: 2.40898752
    size: 64
    element_type: 0
    scale: 13602.3955078125
    zero_point: 0
    value: 0.66217994689941406
    value: 0.67487233877182007
    value: 0.29395559430122375
    value: -0.52211028337478638
    value: 0.093637101352214813
    value: 0.23564507067203522
    value: 0.946281909942627
    value: 2.4089875221252441
    value: 1.1609747409820557
    value: 1.7185884714126587
    value: 0.71437203884124756
    value: 1.32185959815979
    value: 0.55340117216110229
    value: 1.0259491205215454
    value: -0.17450487613677979
    value: 0.12886726856231689
    value: 1.1539390087127686
    value: 0.34173953533172607
    value: 0.29854112863540649
    value: 0.26619184017181396
    value: 0.971515417098999
    value: 0.047449205070734024
    value: 0.47748520970344543
    value: 0.040550004690885544
    value: 0.071399912238121033
    value: 0.791144847869873
    value: 0.67058086395263672
    value: 0.72367608547210693
    value: 0.21684214472770691
    value: 0.36665505170822144
    value: 1.5604234933853149
    value: 1.169347882270813
    value: -0.20793707668781281
    value: 0.79451853036880493
    value: 1.3280894756317139
    value: 0.2844507098197937
    value: 1.2452819347381592
    value: 0.60178482532501221
    value: 0.50159174203872681
    value: 2.0272009372711182
    value: -0.48881718516349792
    value: 0.70343828201293945
    value: 0.6162906289100647
    value: 0.050323393195867538
    value: 1.5098210573196411
    value: 1.6647830009460449
    value: -0.3218231201171875
    value: 1.2171750068664551
    value: 0.94538617134094238
    value: 0.054422605782747269
    value: 0.50303018093109131
    value: 0.54548513889312744
    value: -0.017581546679139137
    value: 0.689179003238678
    value: -0.059124935418367386
    value: 0.057324949651956558
    value: 1.1023038625717163
    value: 0.58084434270858765
    value: 0.91824620962142944
    value: 1.5398014783859253
    value: 0.54048341512680054
    value: 0.07432141900062561
    value: 1.8798909187316895
    value: 0.31097361445426941
  }
}
layers {
  layer_name: "25"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 6.84361124
    size: 1
    element_type: 2
    scale: 3879.238525390625
    zero_point: 0
  }
  weights {
    min: -1.16404188
    max: 1.38278508
    size: 1
    element_type: 3
    scale: 23697.103515625
    zero_point: 0
  }
  bias {
    min: -4.61344194
    max: 3.47136092
    size: 64
    element_type: 0
    scale: 7102.72314453125
    zero_point: 0
    value: 1.5237103700637817
    value: -0.050127096474170685
    value: 0.99665570259094238
    value: 0.38478797674179077
    value: -1.2158795595169067
    value: -0.47553378343582153
    value: -2.0158205032348633
    value: 0.13219213485717773
    value: -1.0927766561508179
    value: -0.64034801721572876
    value: 2.4230036735534668
    value: 0.044897384941577911
    value: 0.93904209136962891
    value: -0.16137559711933136
    value: -1.0003222227096558
    value: -1.9163361787796021
    value: 0.885518491268158
    value: 0.17015932500362396
    value: 3.0579614639282227
    value: -3.9147269725799561
    value: -2.0765495300292969
    value: 1.4577841758728027
    value: 1.610319972038269
    value: 1.0689710378646851
    value: -0.373403400182724
    value: 0.83090293407440186
    value: 1.5102692842483521
    value: -0.93407750129699707
    value: 0.44645482301712036
    value: -4.6134419441223145
    value: 2.6021645069122314
    value: -4.36867618560791
    value: 1.5085393190383911
    value: 0.038127407431602478
    value: 0.60904765129089355
    value: -0.14213976263999939
    value: -1.6388274431228638
    value: 0.95373409986495972
    value: -2.5576708316802979
    value: 1.0407146215438843
    value: -0.14819492399692535
    value: 2.2009139060974121
    value: 2.5932419300079346
    value: -0.10243669897317886
    value: 1.6273889541625977
    value: -3.7334208488464355
    value: 1.5123382806777954
    value: -1.3370471000671387
    value: 3.4713609218597412
    value: 0.43557873368263245
    value: 1.2527761459350586
    value: 1.0358401536941528
    value: 1.7697376012802124
    value: 0.861997127532959
    value: -2.0205671787261963
    value: -3.3070733547210693
    value: 1.0164613723754883
    value: 1.1249129772186279
    value: -1.9128193855285645
    value: 1.016614556312561
    value: 0.77420324087142944
    value: -1.355399489402771
    value: -0.82586979866027832
    value: -0.42685288190841675
  }
}
layers {
  layer_name: "27"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 4.71460915
    size: 1
    element_type: 2
    scale: 11698.9130859375
    zero_point: 0
  }
  weights {
    min: -0.324452877
    max: 0.331589639
    size: 1
    element_type: 3
    scale: 98820.9375
    zero_point: 0
  }
  bias {
    min: -0.9287
    max: 2.57446361
    size: 64
    element_type: 0
    scale: 12728.087890625
    zero_point: 0
    value: -0.20512557029724121
    value: -0.049302469938993454
    value: 0.44236454367637634
    value: -0.038520857691764832
    value: -0.1197756826877594
    value: -0.0042539974674582481
    value: 0.4078376293182373
    value: -0.72662627696990967
    value: 0.32010567188262939
    value: 0.21480725705623627
    value: 0.16401128470897675
    value: 0.48547545075416565
    value: -0.04723222553730011
    value: 0.4406755268573761
    value: -0.60519391298294067
    value: 0.57854741811752319
    value: 0.28963935375213623
    value: -0.34243375062942505
    value: -0.16276393830776215
    value: -0.76576972007751465
    value: -0.29930242896080017
    value: 0.5400664210319519
    value: -0.3593103289604187
    value: 0.39449042081832886
    value: 0.309356689453125
    value: 0.60832345485687256
    value: -0.30281633138656616
    value: -0.05866565927863121
    value: 0.184635728597641
    value: 0.03857426717877388
    value: -0.017089206725358963
    value: 0.90083926916122437
    value: 0.49021309614181519
    value: 0.046170331537723541
    value: -0.0932122990489006
    value: -0.089453943073749542
    value: 0.02509554848074913
    value: 0.40021121501922607
    value: 0.054562792181968689
    value: -0.30414861440658569
    value: -0.19619256258010864
    value: -0.19869798421859741
    value: 0.46827831864356995
    value: 0.25271201133728027
    value: -0.40908941626548767
    value: 0.17645475268363953
    value: 0.10087499022483826
    value: 2.5744636058807373
    value: 1.1809049844741821
    value: -0.879879891872406
    value: -0.058685038238763809
    value: 0.17258362472057343
    value: 0.32398474216461182
    value: 0.25447827577590942
    value: -0.24736300110816956
    value: 0.30057564377784729
    value: 0.29178905487060547
    value: 0.48683497309684753
    value: -0.92869997024536133
    value: -0.0002757996553555131
    value: 0.1536230742931366
    value: -0.15800796449184418
    value: 0.36204960942268372
    value: -0.14835868775844574
  }
}
layers {
  layer_name: "28"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 6.53161812
    size: 1
    element_type: 2
    scale: 5364.15283203125
    zero_point: 0
  }
}
layers {
  layer_name: "30"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.42119312
    size: 1
    element_type: 2
    scale: 5010.7578125
    zero_point: 0
  }
  weights {
    min: -0.774845898
    max: 1.0705272
    size: 1
    element_type: 3
    scale: 30609.216796875
    zero_point: 0
  }
  bias {
    min: -3.45351815
    max: 6.01158285
    size: 64
    element_type: 0
    scale: 5450.810546875
    zero_point: 0
    value: -0.15497219562530518
    value: 3.1289293766021729
    value: 0.029368944466114044
    value: 0.41467589139938354
    value: 0.037375856190919876
    value: 0.36892867088317871
    value: -0.87923258543014526
    value: -0.56682896614074707
    value: -2.322446346282959
    value: -0.98562133312225342
    value: 2.9893944263458252
    value: -0.64999300241470337
    value: 1.0106222629547119
    value: 0.54545867443084717
    value: 0.78089320659637451
    value: -0.31502783298492432
    value: 1.7517063617706299
    value: 0.67509311437606812
    value: -1.2976161241531372
    value: -0.28684109449386597
    value: 0.34419935941696167
    value: -3.0222883224487305
    value: -0.717147946357727
    value: 0.80280172824859619
    value: 0.11074656993150711
    value: 0.80023902654647827
    value: 1.2954609394073486
    value: 1.7467981576919556
    value: -0.75171709060668945
    value: 1.2886453866958618
    value: 1.716943621635437
    value: 6.0115828514099121
    value: -2.730633020401001
    value: 2.2241289615631104
    value: -3.4535181522369385
    value: -0.46822541952133179
    value: 0.829328179359436
    value: 1.4538228511810303
    value: -0.95480155944824219
    value: 0.92237317562103271
    value: -1.6004736423492432
    value: -0.81467598676681519
    value: 2.6026182174682617
    value: 0.70714437961578369
    value: 0.41342812776565552
    value: -0.2641252875328064
    value: 0.87669903039932251
    value: -0.57891243696212769
    value: 2.5394332408905029
    value: 2.3155422210693359
    value: -1.090935230255127
    value: 1.5472073554992676
    value: -0.85831451416015625
    value: 3.8962845802307129
    value: -2.1736981868743896
    value: 0.19272971153259277
    value: 1.611359715461731
    value: 0.6531720757484436
    value: 3.1009383201599121
    value: 2.0868487358093262
    value: 4.0687551498413086
    value: 1.8817576169967651
    value: 2.6842639446258545
    value: -0.69538378715515137
  }
}
layers {
  layer_name: "32"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 6.86919594
    size: 1
    element_type: 2
    scale: 4934.28955078125
    zero_point: 0
  }
  weights {
    min: -0.354361892
    max: 0.507748663
    size: 1
    element_type: 3
    scale: 64535.8671875
    zero_point: 0
  }
  bias {
    min: -1.20552766
    max: 2.03673
    size: 64
    element_type: 0
    scale: 16088.533203125
    zero_point: 0
    value: 1.0984722375869751
    value: 0.63003790378570557
    value: 0.60667765140533447
    value: 0.22771042585372925
    value: 0.28245559334754944
    value: 0.5956496000289917
    value: 0.4431646466255188
    value: -1.205527663230896
    value: 0.785593569278717
    value: -0.19607038795948029
    value: 1.7288023233413696
    value: 0.29908424615859985
    value: 0.40794339776039124
    value: 0.10827772319316864
    value: -0.2140754908323288
    value: 1.1708369255065918
    value: 0.95758992433547974
    value: 0.060755662620067596
    value: -0.55137783288955688
    value: 0.26891106367111206
    value: 0.56006056070327759
    value: 0.97749239206314087
    value: -0.63782793283462524
    value: 0.25306850671768188
    value: -0.18584874272346497
    value: 0.44528627395629883
    value: 0.33052745461463928
    value: 0.5092124342918396
    value: 0.20316141843795776
    value: 0.50635272264480591
    value: 0.021436881273984909
    value: 1.1542556285858154
    value: 0.82001793384552
    value: -0.42096450924873352
    value: 0.018361259251832962
    value: 0.91471767425537109
    value: 0.55891662836074829
    value: 1.0874950885772705
    value: 0.36944442987442017
    value: 0.78709280490875244
    value: 0.49857369065284729
    value: 0.84165221452713013
    value: 0.55559885501861572
    value: 0.43839395046234131
    value: 0.31789851188659668
    value: 1.1815668344497681
    value: 0.10837946087121964
    value: 2.0367300510406494
    value: -0.3952975869178772
    value: 0.077988721430301666
    value: -0.97696191072463989
    value: 0.20576964318752289
    value: 0.25695991516113281
    value: -0.292368620634079
    value: 0.22863183915615082
    value: -0.69015109539031982
    value: 0.724275529384613
    value: 0.44769430160522461
    value: 0.039248224347829819
    value: -0.063069134950637817
    value: -0.0558883436024189
    value: -0.45733347535133362
    value: 0.55757707357406616
    value: -0.078314132988452911
  }
}
layers {
  layer_name: "33"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 9.12710857
    size: 1
    element_type: 2
    scale: 4934.28955078125
    zero_point: 0
  }
}
layers {
  layer_name: "35"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.99756908
    size: 1
    element_type: 2
    scale: 3059.45458984375
    zero_point: 0
  }
  weights {
    min: -0.80640018
    max: 0.753103197
    size: 1
    element_type: 3
    scale: 40634.91015625
    zero_point: 0
  }
  bias {
    min: -2.82688427
    max: 3.20793104
    size: 64
    element_type: 0
    scale: 10214.68359375
    zero_point: 0
    value: -1.2576099634170532
    value: 1.319716215133667
    value: 1.08869469165802
    value: -1.0311406850814819
    value: 1.2211004495620728
    value: -1.360816478729248
    value: 0.80170547962188721
    value: 2.083810567855835
    value: 0.89572399854660034
    value: -0.49659216403961182
    value: 1.3142741918563843
    value: 0.49732166528701782
    value: 1.9606920480728149
    value: 1.7560290098190308
    value: 0.066239103674888611
    value: 0.54787582159042358
    value: 0.41075554490089417
    value: 2.9632258415222168
    value: 1.6241762638092041
    value: 1.8477613925933838
    value: -1.2294672727584839
    value: -0.82503807544708252
    value: 2.5480926036834717
    value: -1.3339605331420898
    value: -1.1240124702453613
    value: 0.35793223977088928
    value: 1.1009138822555542
    value: 0.078939691185951233
    value: 0.81992048025131226
    value: 1.1829452514648438
    value: -0.0012852796353399754
    value: -0.65581727027893066
    value: -0.88513243198394775
    value: -0.33249160647392273
    value: -0.51840388774871826
    value: -2.8268842697143555
    value: 3.2079310417175293
    value: -2.4601998329162598
    value: -1.0907131433486938
    value: -0.24871332943439484
    value: 1.6668988466262817
    value: 0.23208045959472656
    value: -2.4822597503662109
    value: 0.95847630500793457
    value: -1.3332443237304688
    value: 1.5238606929779053
    value: 1.5935616493225098
    value: -1.8517473936080933
    value: -0.2309899628162384
    value: -1.0698544979095459
    value: 1.1136153936386108
    value: 0.58498543500900269
    value: 1.6574978828430176
    value: -1.5191209316253662
    value: -0.053777959197759628
    value: 2.5733773708343506
    value: 2.6382894515991211
    value: -2.4184360504150391
    value: 0.319342702627182
    value: 2.2588717937469482
    value: -1.7889468669891357
    value: -0.035873059183359146
    value: -0.26104453206062317
    value: 0.31047812104225159
  }
}
layers {
  layer_name: "37"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.8043766
    size: 1
    element_type: 2
    scale: 6038.3603515625
    zero_point: 0
  }
  weights {
    min: -0.672786534
    max: 1.01333952
    size: 1
    element_type: 3
    scale: 32336.64453125
    zero_point: 0
  }
  bias {
    min: -2.28498387
    max: 8.58826733
    size: 64
    element_type: 0
    scale: 3815.437744140625
    zero_point: 0
    value: -0.12881883978843689
    value: -0.28317663073539734
    value: 0.5384172797203064
    value: 1.4692960977554321
    value: -0.33570060133934021
    value: 2.1603693962097168
    value: 1.2670834064483643
    value: 1.280947208404541
    value: 2.7579917907714844
    value: 0.041016176342964172
    value: -0.3236808180809021
    value: 1.1591789722442627
    value: 1.3145965337753296
    value: 0.34537544846534729
    value: 0.28672540187835693
    value: 0.7741202712059021
    value: 1.0235955715179443
    value: 0.5584644079208374
    value: 0.15686458349227905
    value: 0.081304952502250671
    value: -0.44162711501121521
    value: -0.68622422218322754
    value: 1.7082374095916748
    value: -1.4038562774658203
    value: 0.41436553001403809
    value: 1.8495466709136963
    value: 0.34406003355979919
    value: 3.5523600578308105
    value: -0.12514509260654449
    value: 0.60503083467483521
    value: 1.3031193017959595
    value: 0.63494569063186646
    value: 0.814024031162262
    value: 1.5558547973632812
    value: 0.19709600508213043
    value: 0.083391830325126648
    value: 0.50794923305511475
    value: 0.11675993353128433
    value: 1.3137962818145752
    value: 1.7638301849365234
    value: 0.23889756202697754
    value: -0.81429517269134521
    value: 0.41270977258682251
    value: 0.57005900144577026
    value: -0.25502744317054749
    value: 8.58826732635498
    value: -0.075088083744049072
    value: 1.218968391418457
    value: 0.690875768661499
    value: 0.70202720165252686
    value: -0.63077044486999512
    value: -0.41527506709098816
    value: -0.4047028124332428
    value: -0.27196270227432251
    value: -0.0014027238357812166
    value: 0.39727568626403809
    value: -0.43344274163246155
    value: 1.1490955352783203
    value: -2.2205255031585693
    value: -2.2849838733673096
    value: 0.47861233353614807
    value: 1.3379027843475342
    value: 0.94704461097717285
    value: -0.23343583941459656
  }
}
layers {
  layer_name: "38"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 12.6429958
    size: 1
    element_type: 2
    scale: 4934.28955078125
    zero_point: 0
  }
}
layers {
  layer_name: "39"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 12.7347975
    size: 1
    element_type: 2
    scale: 3506.518310546875
    zero_point: 0
  }
}
layers {
  layer_name: "41"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 10.4693832
    size: 1
    element_type: 2
    scale: 5300.9814453125
    zero_point: 0
  }
  weights {
    min: -0.661484718
    max: 0.567920446
    size: 1
    element_type: 3
    scale: 49537.046875
    zero_point: 0
  }
  bias {
    min: -3.08049893
    max: 4.09903669
    size: 128
    element_type: 0
    scale: 7994.0732421875
    zero_point: 0
    value: -0.29825389385223389
    value: -0.14526152610778809
    value: 0.84218573570251465
    value: 1.4679371118545532
    value: -0.15888491272926331
    value: 0.68739992380142212
    value: 1.7792432308197021
    value: 0.66499859094619751
    value: -2.5235648155212402
    value: 1.3552531003952026
    value: -0.12444666028022766
    value: -0.13883481919765472
    value: 1.2202377319335938
    value: -2.2799718379974365
    value: 0.94442719221115112
    value: 0.85050404071807861
    value: 1.2075273990631104
    value: -0.295125812292099
    value: -0.9789920449256897
    value: 0.85226637125015259
    value: 0.64944767951965332
    value: -0.30861282348632812
    value: 1.2313755750656128
    value: 2.9835071563720703
    value: 0.96252763271331787
    value: 0.3472169041633606
    value: -0.17174014449119568
    value: 1.5736693143844604
    value: -0.89760106801986694
    value: 1.4700816869735718
    value: 0.57613331079483032
    value: 1.0191833972930908
    value: 1.8607246875762939
    value: 0.16936901211738586
    value: -3.0804989337921143
    value: -0.27480855584144592
    value: 1.3670620918273926
    value: 1.416561484336853
    value: 0.79447841644287109
    value: 0.10413237661123276
    value: 0.84058791399002075
    value: 0.24011309444904327
    value: -2.234717845916748
    value: -1.1457866430282593
    value: 1.5694307088851929
    value: 0.3021596372127533
    value: 0.63492155075073242
    value: -0.69111835956573486
    value: 0.924572229385376
    value: 0.30442133545875549
    value: 1.4678056240081787
    value: -1.7074623107910156
    value: -0.264004111289978
    value: 0.23543030023574829
    value: 1.4589637517929077
    value: 0.83175981044769287
    value: -0.21625913679599762
    value: 0.24329245090484619
    value: -0.35280704498291016
    value: 0.45960959792137146
    value: -2.190683126449585
    value: 0.091549620032310486
    value: 1.6187752485275269
    value: -1.2839208841323853
    value: -1.2219358682632446
    value: 1.1256011724472046
    value: 0.70939123630523682
    value: 1.8934047222137451
    value: 0.34712520241737366
    value: -0.40236306190490723
    value: 0.99224382638931274
    value: -0.23644575476646423
    value: -1.0477498769760132
    value: -0.3872876763343811
    value: 0.36582177877426147
    value: -1.1087533235549927
    value: -0.89984816312789917
    value: -0.44232633709907532
    value: 0.25123971700668335
    value: 0.30087688565254211
    value: -0.75845944881439209
    value: -0.93880689144134521
    value: -1.0976724624633789
    value: 0.36927458643913269
    value: -0.25107765197753906
    value: 2.0694756507873535
    value: 4.099036693572998
    value: 0.37690204381942749
    value: -1.1101241111755371
    value: -2.01580548286438
    value: 0.095628216862678528
    value: 0.14014515280723572
    value: 0.21984736621379852
    value: 2.4651994705200195
    value: -0.073655508458614349
    value: -1.1021765470504761
    value: 0.45162010192871094
    value: -1.5865606069564819
    value: -1.6596560478210449
    value: -0.55437189340591431
    value: -0.09294833242893219
    value: 0.34525454044342041
    value: 0.17602299153804779
    value: 2.9562318325042725
    value: -1.3814496994018555
    value: -2.1898751258850098
    value: -0.4478934109210968
    value: 2.1013848781585693
    value: 1.2538144588470459
    value: 1.3901537656784058
    value: 0.68786931037902832
    value: -0.061235405504703522
    value: 0.23981527984142303
    value: -0.39705711603164673
    value: -0.13365958631038666
    value: -0.29137974977493286
    value: 0.0058651845902204514
    value: 0.060679096728563309
    value: 1.2762960195541382
    value: -1.4258509874343872
    value: -1.4691874980926514
    value: 0.52565670013427734
    value: 0.767020046710968
    value: 0.71824491024017334
    value: -1.9909312725067139
    value: -0.17975081503391266
    value: -0.18395084142684937
    value: 1.4785710573196411
  }
}
layers {
  layer_name: "43"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.45399189
    size: 1
    element_type: 2
    scale: 5315.00439453125
    zero_point: 0
  }
  weights {
    min: -0.49868083
    max: 0.418105811
    size: 1
    element_type: 3
    scale: 65709.3671875
    zero_point: 0
  }
  bias {
    min: -2.05708694
    max: 2.91148615
    size: 256
    element_type: 0
    scale: 11254.7333984375
    zero_point: 0
    value: -0.10427600145339966
    value: 1.3251577615737915
    value: -0.1172705665230751
    value: -1.4275085926055908
    value: -1.2991585731506348
    value: -0.87410694360733032
    value: -0.14011137187480927
    value: -0.66009080410003662
    value: 1.8988394737243652
    value: -0.16727346181869507
    value: -0.0669100433588028
    value: 0.914141058921814
    value: -0.21278733015060425
    value: -0.47364014387130737
    value: -0.33154070377349854
    value: -0.80016487836837769
    value: -0.31622686982154846
    value: -0.37260457873344421
    value: -0.26067507266998291
    value: -0.4168868362903595
    value: 0.08978474885225296
    value: 0.22509627044200897
    value: 0.02439548447728157
    value: -0.070171408355236053
    value: 0.26385599374771118
    value: 1.5279741287231445
    value: -0.066486641764640808
    value: -0.86177486181259155
    value: -0.83724355697631836
    value: 0.1208794116973877
    value: -0.50423943996429443
    value: -1.1048890352249146
    value: -1.2493914365768433
    value: 0.092805519700050354
    value: -0.094805464148521423
    value: -0.1921791136264801
    value: 0.14429299533367157
    value: 1.0643820762634277
    value: -1.3505921363830566
    value: -1.013166069984436
    value: 0.23316779732704163
    value: -0.024745522066950798
    value: 1.7812169790267944
    value: -0.40512445569038391
    value: 0.41284534335136414
    value: 0.347674697637558
    value: -0.79975318908691406
    value: -0.080306835472583771
    value: -0.22171491384506226
    value: 0.5194888710975647
    value: -0.13428691029548645
    value: 0.21008320152759552
    value: 0.939704179763794
    value: -0.56952875852584839
    value: -0.31188744306564331
    value: -0.01340998150408268
    value: -0.25810864567756653
    value: 0.10968341678380966
    value: -1.9767382144927979
    value: -0.43997645378112793
    value: -1.2238759994506836
    value: 1.0572937726974487
    value: -0.19013264775276184
    value: -0.70979475975036621
    value: -1.2394024133682251
    value: 0.21274098753929138
    value: 0.28954389691352844
    value: -0.3850257396697998
    value: -0.773972749710083
    value: -1.0829893350601196
    value: -0.7556002140045166
    value: -0.74057281017303467
    value: -1.0754944086074829
    value: 0.59429728984832764
    value: 0.098294287919998169
    value: -0.0571814700961113
    value: 0.060657702386379242
    value: 0.33367764949798584
    value: 0.97543644905090332
    value: 0.32637211680412292
    value: -0.47957634925842285
    value: 0.56645756959915161
    value: 2.9114861488342285
    value: -0.010318193584680557
    value: -0.56619381904602051
    value: -0.5101514458656311
    value: -0.33793991804122925
    value: -0.037358459085226059
    value: -0.42268621921539307
    value: 0.26027828454971313
    value: -0.31916132569313049
    value: 1.8825998306274414
    value: -0.92884147167205811
    value: 0.094419717788696289
    value: -1.0518568754196167
    value: 1.6066161394119263
    value: -0.39045602083206177
    value: 0.15901905298233032
    value: 0.88514584302902222
    value: -0.68860536813735962
    value: 0.88805121183395386
    value: -0.13554628193378448
    value: 1.9752953052520752
    value: 1.1403216123580933
    value: -0.021867880597710609
    value: -1.0725808143615723
    value: -0.13461767137050629
    value: -1.3160611391067505
    value: -0.83673226833343506
    value: 0.0099107557907700539
    value: -0.23922021687030792
    value: -0.47788968682289124
    value: -0.52894330024719238
    value: 2.6347401142120361
    value: 0.88681972026824951
    value: -0.95650804042816162
    value: 0.39027765393257141
    value: -0.26466932892799377
    value: -0.837893545627594
    value: 0.23947425186634064
    value: -0.13825927674770355
    value: 0.32292720675468445
    value: 0.96597802639007568
    value: 0.34553822875022888
    value: 0.36361294984817505
    value: 0.76240462064743042
    value: -0.20514751970767975
    value: 1.8743680715560913
    value: -2.0570869445800781
    value: 0.41228005290031433
    value: -0.53151267766952515
    value: -0.50397533178329468
    value: -0.45092746615409851
    value: -0.8481438159942627
    value: -0.66448020935058594
    value: 0.38814559578895569
    value: -1.1431670188903809
    value: -1.1392536163330078
    value: 0.346199631690979
    value: -1.249739408493042
    value: 0.46100705862045288
    value: -0.6246720552444458
    value: -1.1452919244766235
    value: -0.79446440935134888
    value: -0.076966427266597748
    value: 0.083457231521606445
    value: -0.029977250844240189
    value: -0.36272779107093811
    value: -0.09402947872877121
    value: 0.22191138565540314
    value: -0.94175267219543457
    value: -0.16623632609844208
    value: -0.35443830490112305
    value: -0.2071121484041214
    value: -1.0162851810455322
    value: 1.7440297603607178
    value: -0.57302254438400269
    value: -0.21817976236343384
    value: 0.31535887718200684
    value: 0.82121479511260986
    value: 0.08530774712562561
    value: 0.01713932678103447
    value: 0.22471153736114502
    value: -0.47562298178672791
    value: -1.1408921480178833
    value: 0.58932048082351685
    value: -0.21639004349708557
    value: -0.78740787506103516
    value: -0.55244404077529907
    value: 0.22389516234397888
    value: -0.18712823092937469
    value: 0.39184299111366272
    value: -0.076534055173397064
    value: 1.012031078338623
    value: 0.062614105641841888
    value: -0.22138760983943939
    value: 0.30017846822738647
    value: 0.67688459157943726
    value: -0.81153559684753418
    value: -0.17129702866077423
    value: 0.55740231275558472
    value: -0.33305263519287109
    value: -0.38109984993934631
    value: -0.72802287340164185
    value: -0.99917352199554443
    value: 0.74736016988754272
    value: -0.48076498508453369
    value: -0.28140744566917419
    value: 0.16312454640865326
    value: 0.52946490049362183
    value: -0.47838133573532104
    value: -0.832042396068573
    value: -0.90160703659057617
    value: -1.1472054719924927
    value: 0.014596822671592236
    value: 0.021389851346611977
    value: -0.6871381402015686
    value: -0.47388893365859985
    value: -1.8161789178848267
    value: -0.936968207359314
    value: -0.47823977470397949
    value: 0.60303109884262085
    value: -0.3025413453578949
